surfaceMountedCube_les/initChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
    (0 0 2)
    (1 0 2)
    (1 1 2)
    (0 1 2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   (1 1 50) simpleGrading (1 1  100)
    hex (4 5 6 7 8 9 10 11) (1 1 50) simpleGrading (1 1 -100)
);

edges
(
);

boundary
(
    lowerWall
    {
        type    wall;
        faces
        (
            (0 3 2 1)
        );
    }

    upperWall
    {
        type    wall;
        faces
        (
            (8 9 10 11)
        );
    }

    inlet
    {
        type    cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
        );
    }

    outlet
    {
        type    cyclic;
        neighbourPatch inlet;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
        );
    }

    frontAndBack
    {
        type    empty;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (3 7 6 2)
            (7 11 10 6)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
