surfaceMountedCube_les/initChannel/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 180.18; // 10;

boundaryField
{
    lowerWall
    {
        type            fixedValue;
        value           uniform 1e-08;
    }

    upperWall
    {
        type            fixedValue;
        value           uniform 1e-08;
    }

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
